cf_billing/InformationRegisters/энргИсторияОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргИсторияОплаты</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАвизо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКРаспределению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргИсторияОплаты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПоследняяОплатаАбонента(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	Если Схема = Неопределено Тогда
		Схема  = Новый СхемаЗапроса;
		Пакет  = Схема.ПакетЗапросов[0];
	Иначе
		Пакет  = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	энргИсторияОплатыСрезПоследних.Период КАК Период,
	|	энргИсторияОплатыСрезПоследних.Регистратор КАК Регистратор,
	|	энргИсторияОплатыСрезПоследних.Организация КАК Организация,
	|	энргИсторияОплатыСрезПоследних.Район КАК Район,
	|	энргИсторияОплатыСрезПоследних.Абонент КАК Абонент,
	|	энргИсторияОплатыСрезПоследних.Разделитель КАК Разделитель,
	|	энргИсторияОплатыСрезПоследних.ДатаПлатежа КАК ДатаПлатежа,
	|	энргИсторияОплатыСрезПоследних.СуммаПлатежа КАК СуммаПлатежа,
	|	энргИсторияОплатыСрезПоследних.ИсточникПоступления КАК ИсточникПоступления	
	|ПОМЕСТИТЬ АктуальныеОплаты
	|ИЗ
	|	РегистрСведений.энргИсторияОплаты.СрезПоследних КАК энргИсторияОплатыСрезПоследних");
	
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;
	                              	
	ПараметрПериод 						= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1", ПараметрыОтбора.Период.ИмяПараметра));		
	КонецЕсли; 	
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 				= "Организация, Район, Абонент, Разделитель";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность";
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПоследняяОплатаАбонента());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
КонецПроцедуры 

Процедура ПолнаяИсторияОплат(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	Если Схема = Неопределено Тогда
		Схема  = Новый СхемаЗапроса;
		Пакет  = Схема.ПакетЗапросов[0];
	Иначе
		Пакет  = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПолнаяИсторияОплат());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;
		
	ДоступныеПараметры 					= "Период, Регистратор, Организация, Район, Абонент, Разделитель";
	Если ПараметрыОтбора.Свойство("Отбор") Тогда
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, "энргИсторияОплаты", ПараметрыОтбора.Отбор, ДоступныеПараметры);		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПоследняяОплатаАбонента() 
	
	Текст  =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодМаксимум КАК ПериодМаксимум,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.РазделительМаксимум КАК Разделитель,
	|	АктуальныеОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	АктуальныеОплаты.СуммаПлатежа КАК СуммаПлатежа,
	|	АктуальныеОплаты.ИсточникПоступления КАК ИсточникПоступления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.Абонент КАК Абонент,
	|		ВложенныйЗапрос.ПериодМаксимум КАК ПериодМаксимум,
	|		ВложенныйЗапрос.РегистраторМаксимум КАК РегистраторМаксимум,
	|		МАКСИМУМ(АктуальныеОплаты.Разделитель) КАК РазделительМаксимум
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Организация КАК Организация,
	|			ВложенныйЗапрос.Район КАК Район,
	|			ВложенныйЗапрос.Абонент КАК Абонент,
	|			ВложенныйЗапрос.ПериодМаксимум КАК ПериодМаксимум,
	|			МАКСИМУМ(АктуальныеОплаты.Регистратор) КАК РегистраторМаксимум
	|		ИЗ
	|			(ВЫБРАТЬ
	|				АктуальныеОплаты.Организация КАК Организация,
	|				АктуальныеОплаты.Район КАК Район,
	|				АктуальныеОплаты.Абонент КАК Абонент,
	|				МАКСИМУМ(АктуальныеОплаты.Период) КАК ПериодМаксимум
	|			ИЗ
	|				АктуальныеОплаты КАК АктуальныеОплаты
	|			
	|			СГРУППИРОВАТЬ ПО
	|				АктуальныеОплаты.Организация,
	|				АктуальныеОплаты.Район,
	|				АктуальныеОплаты.Абонент) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ АктуальныеОплаты КАК АктуальныеОплаты
	|				ПО ВложенныйЗапрос.Организация = АктуальныеОплаты.Организация
	|					И ВложенныйЗапрос.Район = АктуальныеОплаты.Район
	|					И ВложенныйЗапрос.Абонент = АктуальныеОплаты.Абонент
	|					И ВложенныйЗапрос.ПериодМаксимум = АктуальныеОплаты.Период
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.Организация,
	|			ВложенныйЗапрос.Район,
	|			ВложенныйЗапрос.Абонент,
	|			ВложенныйЗапрос.ПериодМаксимум) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АктуальныеОплаты КАК АктуальныеОплаты
	|			ПО ВложенныйЗапрос.Организация = АктуальныеОплаты.Организация
	|				И ВложенныйЗапрос.Район = АктуальныеОплаты.Район
	|				И ВложенныйЗапрос.Абонент = АктуальныеОплаты.Абонент
	|				И ВложенныйЗапрос.РегистраторМаксимум = АктуальныеОплаты.Регистратор
	|				И ВложенныйЗапрос.ПериодМаксимум = АктуальныеОплаты.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Район,
	|		ВложенныйЗапрос.РегистраторМаксимум,
	|		ВложенныйЗапрос.Абонент,
	|		ВложенныйЗапрос.ПериодМаксимум,
	|		ВложенныйЗапрос.Организация) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АктуальныеОплаты КАК АктуальныеОплаты
	|		ПО ВложенныйЗапрос.Организация = АктуальныеОплаты.Организация
	|			И ВложенныйЗапрос.Район = АктуальныеОплаты.Район
	|			И ВложенныйЗапрос.Абонент = АктуальныеОплаты.Абонент
	|			И ВложенныйЗапрос.ПериодМаксимум = АктуальныеОплаты.Период
	|			И ВложенныйЗапрос.РегистраторМаксимум = АктуальныеОплаты.Регистратор
	|			И ВложенныйЗапрос.РазделительМаксимум = АктуальныеОплаты.Разделитель";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПолнаяИсторияОплат()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргИсторияОплаты.Период КАК Период,
	|	энргИсторияОплаты.Регистратор КАК Регистратор,
	|	энргИсторияОплаты.Абонент КАК Абонент,
	|	энргИсторияОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	энргИсторияОплаты.СуммаПлатежа КАК СуммаПлатежа
	|ИЗ
	|	РегистрСведений.энргИсторияОплаты КАК энргИсторияОплаты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Регистратор";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
